MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/include/hal_com_reg.h
#define REG_PNO_STATUS					0x0631
#define REG_USTIME_EDCA				0x0638
#define REG_MAC_SPEC_SIFS				0x063A
/* 20100719 Joseph: Hardware register definition change. (HW datasheet v54) */
#define REG_RESP_SIFS_CCK				0x063C	/* [15:8]SIFS_R2T_OFDM, [7:0]SIFS_R2T_CCK */
#define REG_RESP_SIFS_OFDM                    0x063E	/* [15:8]SIFS_T2T_OFDM, [7:0]SIFS_T2T_CCK */

#define REG_ACKTO						0x0640
#define REG_CTS2TO						0x0641
#define REG_EIFS							0x0642

/*REG_TCR*/
#define BIT_PWRBIT_OW_EN BIT(7)

/* RXERR_RPT */
#define RXERR_TYPE_OFDM_PPDU			0
#define RXERR_TYPE_OFDM_FALSE_ALARM	1
#define RXERR_TYPE_OFDM_MPDU_OK		2
#define RXERR_TYPE_OFDM_MPDU_FAIL	3
#define RXERR_TYPE_CCK_PPDU			4
#define RXERR_TYPE_CCK_FALSE_ALARM	5
#define RXERR_TYPE_CCK_MPDU_OK		6
#define RXERR_TYPE_CCK_MPDU_FAIL		7
#define RXERR_TYPE_HT_PPDU				8
#define RXERR_TYPE_HT_FALSE_ALARM	9
#define RXERR_TYPE_HT_MPDU_TOTAL		10
#define RXERR_TYPE_HT_MPDU_OK			11
#define RXERR_TYPE_HT_MPDU_FAIL		12
#define RXERR_TYPE_RX_FULL_DROP		15

#define RXERR_COUNTER_MASK			0xFFFFF
#define RXERR_RPT_RST					BIT(27)
#define _RXERR_RPT_SEL(type)			((type) << 28)

/*
* Note:
*	The NAV upper value is very important to WiFi 11n 5.2.3 NAV test. The default value is
*	always too small, but the WiFi TestPlan test by 25,000 microseconds of NAV through sending
*	CTS in the air. We must update this value greater than 25,000 microseconds to pass the item.
*	The offset of NAV_UPPER in 8192C Spec is incorrect, and the offset should be 0x0652. Commented
*	by SD1 Scott.
* By Bruce, 2011-07-18.
*   */
#define REG_NAV_UPPER					0x0652	/* unit of 128 */

/* WMA, BA, CCX */
#define REG_NAV_CTRL					0x0650
#define REG_BACAMCMD					0x0654
#define REG_BACAMCONTENT				0x0658
#define REG_LBDLY						0x0660
#define REG_FWDLY						0x0661
#define REG_RXERR_RPT					0x0664
#define REG_WMAC_TRXPTCL_CTL			0x0668

/* Security */
#define REG_CAMCMD						0x0670
#define REG_CAMWRITE					0x0674
#define REG_CAMREAD					0x0678
#define REG_CAMDBG						0x067C
#define REG_SECCFG						0x0680

/* Power */
#define REG_WOW_CTRL					0x0690
#define REG_PS_RX_INFO					0x0692
#define REG_WMMPS_UAPSD_TID			0x0693
#define REG_WKFMCAM_CMD				0x0698
#define REG_WKFMCAM_NUM				REG_WKFMCAM_CMD
#define REG_WKFMCAM_RWD				0x069C
#define REG_RXFLTMAP0					0x06A0
#define REG_RXFLTMAP1					0x06A2
#define REG_RXFLTMAP2					0x06A4
#define REG_BCN_PSR_RPT				0x06A8
#define REG_BT_COEX_TABLE				0x06C0

#define BIT_WKFCAM_WE					BIT(16)
#define BIT_WKFCAM_POLLING_V1				BIT(31)
#define BIT_WKFCAM_CLR_V1				BIT(30)
#define BIT_SHIFT_WKFCAM_ADDR_V2			8
#define BIT_MASK_WKFCAM_ADDR_V2			0xff
#define BIT_WKFCAM_ADDR_V2(x)				(((x) & BIT_MASK_WKFCAM_ADDR_V2) << BIT_SHIFT_WKFCAM_ADDR_V2)

/* Hardware Port 1 */
#define REG_MACID1						0x0700
#define REG_BSSID1						0x0708

/* Enable/Disable Port 0 and Port 1 for Specific ICs (ex. 8192F)*/
#define REG_WLAN_ACT_MASK_CTRL_1		0x076C

/* GPIO Control */
#define REG_SW_GPIO_SHARE_CTRL_0		0x1038
#define REG_SW_GPIO_SHARE_CTRL_1		0x103C
#define REG_SW_GPIO_A_OUT				0x1040
#define REG_SW_GPIO_A_OEN				0x1044
#define REG_SW_GPIO_B_OEN				0x1058
#define REG_SW_GPIO_B_OUT				0x105C

/* Hardware Port 2 */
#define REG_MACID2						0x1620
#define REG_BSSID2						0x1628
/* Hardware Port 3*/
#define REG_MACID3						0x1630
#define REG_BSSID3						0x1638
/* Hardware Port 4 */
#define REG_MACID4						0x1640
#define REG_BSSID4						0x1648


#define REG_CR_EXT						0x1100

/* -----------------------------------------------------
*
*	0xFE00h ~ 0xFE55h	USB Configuration
*
* ----------------------------------------------------- */
#define REG_USB_INFO					0xFE17
#define REG_USB_SPECIAL_OPTION		0xFE55
#define REG_USB_DMA_AGG_TO			0xFE5B
#define REG_USB_AGG_TO					0xFE5C
#define REG_USB_AGG_TH					0xFE5D

#define REG_USB_HRPWM					0xFE58
#define REG_USB_HCPWM					0xFE57

/* for 92DU high_Queue low_Queue Normal_Queue select */
#define REG_USB_High_NORMAL_Queue_Select_MAC0	0xFE44
/* #define REG_USB_LOW_Queue_Select_MAC0		0xFE45 */
#define REG_USB_High_NORMAL_Queue_Select_MAC1	0xFE47
/* #define REG_USB_LOW_Queue_Select_MAC1		0xFE48 */

/* For test chip */
#define REG_TEST_USB_TXQS				0xFE48
#define REG_TEST_SIE_VID				0xFE60		/* 0xFE60~0xFE61 */
#define REG_TEST_SIE_PID				0xFE62		/* 0xFE62~0xFE63 */
#define REG_TEST_SIE_OPTIONAL			0xFE64
#define REG_TEST_SIE_CHIRP_K			0xFE65
#define REG_TEST_SIE_PHY				0xFE66		/* 0xFE66~0xFE6B */
#define REG_TEST_SIE_MAC_ADDR			0xFE70		/* 0xFE70~0xFE75 */
#define REG_TEST_SIE_STRING			0xFE80		/* 0xFE80~0xFEB9 */


/* For normal chip */
#define REG_NORMAL_SIE_VID				0xFE60		/* 0xFE60~0xFE61 */
#define REG_NORMAL_SIE_PID				0xFE62		/* 0xFE62~0xFE63 */
#define REG_NORMAL_SIE_OPTIONAL		0xFE64
#define REG_NORMAL_SIE_EP				0xFE65		/* 0xFE65~0xFE67 */
#define REG_NORMAL_SIE_PHY			0xFE68		/* 0xFE68~0xFE6B */
#define REG_NORMAL_SIE_OPTIONAL2		0xFE6C
#define REG_NORMAL_SIE_GPS_EP			0xFE6D		/* 0xFE6D, for RTL8723 only. */
#define REG_NORMAL_SIE_MAC_ADDR		0xFE70		/* 0xFE70~0xFE75 */
#define REG_NORMAL_SIE_STRING			0xFE80		/* 0xFE80~0xFEDF */


/* -----------------------------------------------------
*
*	Redifine 8192C register definition for compatibility
*
* ----------------------------------------------------- */

/* TODO: use these definition when using REG_xxx naming rule.
* NOTE: DO NOT Remove these definition. Use later. */

#define EFUSE_CTRL				REG_EFUSE_CTRL		/* E-Fuse Control. */
#define EFUSE_TEST				REG_EFUSE_TEST		/* E-Fuse Test. */
#define MSR						(REG_CR + 2)		/* Media Status register */
/* #define ISR						REG_HISR */
#define MSR1						REG_CR_EXT

#define TSFR						REG_TSFTR			/* Timing Sync Function Timer Register. */
#define TSFR1					REG_TSFTR1			/* HW Port 1 TSF Register */

#define PBP						REG_PBP

/* Redifine MACID register, to compatible prior ICs. */
#define IDR0						REG_MACID			/* MAC ID Register, Offset 0x0050-0x0053 */
#define IDR4						(REG_MACID + 4)		/* MAC ID Register, Offset 0x0054-0x0055 */

/* Unused register */
#define UnusedRegister			0x1BF
#define DCAM					UnusedRegister
#define PSR						UnusedRegister
#define BBAddr					UnusedRegister
#define PhyDataR					UnusedRegister

